package com.pay.library.string;

/**
 * Created by 25171 on 2017/11/22.
 */

public class JsonStr {

    public final static String bankJson = "[\"中国工商银行\",\"中国农业银行\",\"中国银行\",\"中国建设银行\",\"中国邮政储蓄银行\",\"浦发银行\",\"民生银行\",\"华夏银行\",\"平安银行\",\"广东发展银行\",\"北京银行\",\"长江商业银行\",\"东莞银行\",\"广东发展银行\",\"光大银行\",\"甘肃农信社\",\"广东南粤银行\",\"广州银行\",\"华夏银行\",\"杭州银行\",\"黑龙江农信社\",\"江苏银行\",\"民生银行\",\"宁波银行\",\"浦发银行\",\"平安银行\",\"上海银行\",\"深农商行\",\"山东农信社\",\"武汉农商行\",\"兴业银行\",\"中国工商银行\",\"中国农业银行\",\"中国银行 \",\"中国建设银行\",\"中国邮政储蓄银行\",\"中国交通银行\",\"浙商银行\",\"招商银行\",\"中信银行\"]";

    public final static String SupportBank ="1、如何查看信用卡的有效期与CVN2信息？\n" +
            "信用卡有效期为正面中间的带/的两个数字信息。如08/13前面是月份，后面是年份。安全码（CVN2)是您信用卡背面签名栏数字后三位。\n" +

            "2、收不到短信验证码怎么办？\n" +
            "网络通讯异常时会造成短信丢失或延时，如果出现丢失或延时未收到短信，需要您耐心等待一下，并请确认您的短信没有被安全软件拦截。您也可以尝试再次点击页面上的获取按钮，重新获取短信验证码。如有疑问请致电：400-018-8888\n" +
            "3、银行预留手机号码错误？\n" +
            "银行预留手机号码错误，应致电相关发卡银行进行修改。\n" +
            "4、我在银行预留的手机号码已停用怎么办？\n" +
            "银行预留的手机号码已停用，应致电相关发卡银行进行修改。\n" +
            "5、哪些银行需要先自行开通在线支付业务才可使用？\n" +
            "在柜台/网银等自有渠道：中国银行借记卡、交通银行借记卡、民生银行借记卡、需在柜台/网银开通：邮政银行借记卡、中信银行借记卡、浦发银行借记卡、温州银行信用卡。\n" +
            "6、手机单笔支付限额是多少？\n" +
            "单笔支付限额以发卡行规定限额为准。\n" +
            "7、银行卡扣款成功了却显示支付失败？\n" +
            "如果您确认已扣款成功了，由于网络延迟原因返回信息有误，请您不必着急，以商户客户端支付结果为准。\n" +
            "8、信息泄露如何处理？\n" +
            "若发生银行卡遗失，密码泄露，请第一时间致电发卡行冻结相关银行卡。\n" +
            "9、信用卡到期如何处理？\n" +
            "针对已签约绑定的银行卡若超过有效期，将显示已过期状态，请您及时去银行更换，通过前端提示点击”更新并支付“重新签约完成支付继续使用。\n" +
            "10、银行卡丢卡后如何处理？\n" +
            "若确认您的银行卡已丢失，请第一时间与银行联系挂失补卡，取得新卡后先解绑再重新绑定新卡继续使用。若有问题请及时与我们客服联系。";
}
